ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/emlib/inc/em_smu.h
/** SMU peripheral privileged access enablers. */
typedef struct {
#if defined(_SILICON_LABS_GECKO_INTERNAL_SDID_84)
    bool privilegedACMP0      : 1;     /**< Privileged access enabler for ACMP0     */
    bool privilegedACMP1      : 1;     /**< Privileged access enabler for ACMP1     */
    bool privilegedADC0       : 1;     /**< Privileged access enabler for ADC0      */
    bool privilegedReserved0  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedReserved1  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedCMU        : 1;     /**< Privileged access enabler for CMU       */
    bool privilegedReserved2  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedCRYOTIMER  : 1;     /**< Privileged access enabler for CRYOTIMER */
    bool privilegedCRYPTO0    : 1;     /**< Privileged access enabler for CRYPTO0   */
    bool privilegedCRYPTO1    : 1;     /**< Privileged access enabler for CRYPTO1   */
    bool privilegedCSEN       : 1;     /**< Privileged access enabler for CSEN      */
    bool privilegedVDAC0      : 1;     /**< Privileged access enabler for VDAC0     */
    bool privilegedPRS        : 1;     /**< Privileged access enabler for PRS       */
    bool privilegedEMU        : 1;     /**< Privileged access enabler for EMU       */
    bool privilegedFPUEH      : 1;     /**< Privileged access enabler for FPUEH     */
    bool privilegedReserved3  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedGPCRC      : 1;     /**< Privileged access enabler for GPCRC     */
    bool privilegedGPIO       : 1;     /**< Privileged access enabler for GPIO      */
    bool privilegedI2C0       : 1;     /**< Privileged access enabler for I2C0      */
    bool privilegedI2C1       : 1;     /**< Privileged access enabler for I2C1      */
    bool privilegedIDAC0      : 1;     /**< Privileged access enabler for IDAC0     */
    bool privilegedMSC        : 1;     /**< Privileged access enabler for MSC       */
    bool privilegedLDMA       : 1;     /**< Privileged access enabler for LDMA      */
    bool privilegedLESENSE    : 1;     /**< Privileged access enabler for LESENSE   */
    bool privilegedLETIMER0   : 1;     /**< Privileged access enabler for LETIMER0  */
    bool privilegedLEUART0    : 1;     /**< Privileged access enabler for LEUART0   */
    bool privilegedReserved4  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedPCNT0      : 1;     /**< Privileged access enabler for PCNT0     */
    bool privilegedPCNT1      : 1;     /**< Privileged access enabler for PCNT1     */
    bool privilegedPCNT2      : 1;     /**< Privileged access enabler for PCNT2     */
    bool privilegedReserved5  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedReserved6  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedReserved7  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedRMU        : 1;     /**< Privileged access enabler for RMU       */
    bool privilegedRTCC       : 1;     /**< Privileged access enabler for RTCC      */
    bool privilegedSMU        : 1;     /**< Privileged access enabler for SMU       */
    bool privilegedReserved8  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedTIMER0     : 1;     /**< Privileged access enabler for TIMER0    */
    bool privilegedTIMER1     : 1;     /**< Privileged access enabler for TIMER1    */
    bool privilegedTRNG0      : 1;     /**< Privileged access enabler for TRNG0     */
    bool privilegedUSART0     : 1;     /**< Privileged access enabler for USART0    */
    bool privilegedUSART1     : 1;     /**< Privileged access enabler for USART1    */
    bool privilegedUSART2     : 1;     /**< Privileged access enabler for USART2    */
    bool privilegedUSART3     : 1;     /**< Privileged access enabler for USART3    */
    bool privilegedWDOG0      : 1;     /**< Privileged access enabler for WDOG0     */
    bool privilegedWDOG1      : 1;     /**< Privileged access enabler for WDOG1     */
    bool privilegedWTIMER0    : 1;     /**< Privileged access enabler for WTIMER0   */
    bool privilegedWTIMER1    : 1;     /**< Privileged access enabler for WTIMER1   */

#elif defined(_SILICON_LABS_GECKO_INTERNAL_SDID_89)
    bool privilegedACMP0      : 1;     /**< Privileged access enabler for ACMP0     */
    bool privilegedACMP1      : 1;     /**< Privileged access enabler for ACMP1     */
    bool privilegedADC0       : 1;     /**< Privileged access enabler for ADC0      */
    bool privilegedReserved0  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedReserved1  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedCMU        : 1;     /**< Privileged access enabler for CMU       */
    bool privilegedReserved2  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedCRYOTIMER  : 1;     /**< Privileged access enabler for CRYOTIMER */
    bool privilegedCRYPTO0    : 1;     /**< Privileged access enabler for CRYPTO0   */
    bool privilegedCRYPTO1    : 1;     /**< Privileged access enabler for CRYPTO1   */
    bool privilegedCSEN       : 1;     /**< Privileged access enabler for CSEN      */
    bool privilegedVDAC0      : 1;     /**< Privileged access enabler for VDAC0     */
    bool privilegedPRS        : 1;     /**< Privileged access enabler for PRS       */
    bool privilegedEMU        : 1;     /**< Privileged access enabler for EMU       */
    bool privilegedFPUEH      : 1;     /**< Privileged access enabler for FPUEH     */
    bool privilegedReserved3  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedGPCRC      : 1;     /**< Privileged access enabler for GPCRC     */
    bool privilegedGPIO       : 1;     /**< Privileged access enabler for GPIO      */
    bool privilegedI2C0       : 1;     /**< Privileged access enabler for I2C0      */
    bool privilegedI2C1       : 1;     /**< Privileged access enabler for I2C1      */
    bool privilegedIDAC0      : 1;     /**< Privileged access enabler for IDAC0     */
    bool privilegedMSC        : 1;     /**< Privileged access enabler for MSC       */
    bool privilegedLDMA       : 1;     /**< Privileged access enabler for LDMA      */
    bool privilegedLESENSE    : 1;     /**< Privileged access enabler for LESENSE   */
    bool privilegedLETIMER0   : 1;     /**< Privileged access enabler for LETIMER0  */
    bool privilegedLEUART0    : 1;     /**< Privileged access enabler for LEUART0   */
    bool privilegedReserved4  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedPCNT0      : 1;     /**< Privileged access enabler for PCNT0     */
    bool privilegedReserved5  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedReserved6  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedReserved7  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedReserved8  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedRMU        : 1;     /**< Privileged access enabler for RMU       */
    bool privilegedRTCC       : 1;     /**< Privileged access enabler for RTCC      */
    bool privilegedSMU        : 1;     /**< Privileged access enabler for SMU       */
    bool privilegedReserved9  : 1;     /**< Reserved privileged access enabler      */
    bool privilegedTIMER0     : 1;     /**< Privileged access enabler for TIMER0    */
    bool privilegedTIMER1     : 1;     /**< Privileged access enabler for TIMER1    */
    bool privilegedTRNG0      : 1;     /**< Privileged access enabler for TRNG0     */
    bool privilegedUSART0     : 1;     /**< Privileged access enabler for USART0    */
    bool privilegedUSART1     : 1;     /**< Privileged access enabler for USART1    */
    bool privilegedUSART2     : 1;     /**< Privileged access enabler for USART2    */
    bool privilegedWDOG0      : 1;     /**< Privileged access enabler for WDOG0     */
    bool privilegedWDOG1      : 1;     /**< Privileged access enabler for WDOG1     */
    bool privilegedWTIMER0    : 1;     /**< Privileged access enabler for WTIMER0   */

#elif defined(_SILICON_LABS_GECKO_INTERNAL_SDID_95)
    bool privilegedACMP0      : 1;     /**< Privileged access enabler for           */
    bool privilegedACMP1      : 1;     /**< Privileged access enabler for           */
    bool privilegedADC0       : 1;     /**< Privileged access enabler for           */
    bool privilegedReserved0  : 1;
    bool privilegedReserved1  : 1;
    bool privilegedCMU        : 1;     /**< Privileged access enabler for           */
    bool privilegedReserved2  : 1;
    bool privilegedCRYOTIMER  : 1;     /**< Privileged access enabler for           */
    bool privilegedCRYPTO     : 1;     /**< Privileged access enabler for           */
    bool privilegedVDAC0      : 1;     /**< Privileged access enabler for           */
    bool privilegedPRS        : 1;     /**< Privileged access enabler for           */
    bool privilegedEMU        : 1;     /**< Privileged access enabler for           */
    bool privilegedFPUEH      : 1;     /**< Privileged access enabler for           */
    bool privilegedReserved3  : 1;
    bool privilegedGPCRC      : 1;     /**< Privileged access enabler for           */
    bool privilegedGPIO       : 1;     /**< Privileged access enabler for           */
    bool privilegedI2C0       : 1;     /**< Privileged access enabler for           */
    bool privilegedIDAC0      : 1;     /**< Privileged access enabler for           */
    bool privilegedMSC        : 1;     /**< Privileged access enabler for           */
    bool privilegedLDMA       : 1;     /**< Privileged access enabler for           */
    bool privilegedLESENSE    : 1;     /**< Privileged access enabler for           */
    bool privilegedLETIMER0   : 1;     /**< Privileged access enabler for           */
    bool privilegedLEUART     : 1;     /**< Privileged access enabler for           */
    bool privilegedReserved4  : 1;
    bool privilegedPCNT0      : 1;     /**< Privileged access enabler for           */
    bool privilegedReserved5  : 1;
    bool privilegedReserved6  : 1;
    bool privilegedReserved7  : 1;
    bool privilegedReserved8  : 1;
    bool privilegedRMU        : 1;     /**< Privileged access enabler for           */
    bool privilegedRTCC       : 1;     /**< Privileged access enabler for           */
    bool privilegedSMU        : 1;     /**< Privileged access enabler for           */

    bool privilegedReserved9  : 1;
    bool privilegedTIMER0     : 1;     /**< Privileged access enabler for           */
    bool privilegedTIMER1     : 1;     /**< Privileged access enabler for           */
    bool privilegedTRNG0      : 1;     /**< Privileged access enabler for           */
    bool privilegedUSART0     : 1;     /**< Privileged access enabler for           */
    bool privilegedUSART1     : 1;     /**< Privileged access enabler for           */
    bool privilegedWDOG0      : 1;     /**< Privileged access enabler for           */
    bool privilegedWDOG1      : 1;     /**< Privileged access enabler for           */
    bool privilegedWTIMER0    : 1;     /**< Privileged access enabler for           */

#elif defined(_SILICON_LABS_GECKO_INTERNAL_SDID_100)
    bool privilegedACMP0      : 1;     /**< Privileged access enabler for ACMP0     */
    bool privilegedACMP1      : 1;     /**< Privileged access enabler for ACMP1     */
    bool privilegedACMP2      : 1;     /**< Privileged access enabler for ACMP2     */
    bool privilegedACMP3      : 1;     /**< Privileged access enabler for ACMP3     */
    bool privilegedADC0       : 1;     /**< Privileged access enabler for ADC0      */
    bool privilegedADC1       : 1;     /**< Privileged access enabler for ADC1      */
    bool privilegedCAN0       : 1;     /**< Privileged access enabler for CAN0      */
    bool privilegedCAN1       : 1;     /**< Privileged access enabler for CAN1      */
    bool privilegedCMU        : 1;     /**< Privileged access enabler for CMU       */
    bool privilegedCRYOTIMER  : 1;     /**< Privileged access enabler for CRYOTIMER */
    bool privilegedCRYPTO0    : 1;     /**< Privileged access enabler for CRYPTO0   */
    bool privilegedCSEN       : 1;     /**< Privileged access enabler for CSEN      */
    bool privilegedVDAC0      : 1;     /**< Privileged access enabler for VDAC0     */
    bool privilegedPRS        : 1;     /**< Privileged access enabler for PRS       */
    bool privilegedEBI        : 1;     /**< Privileged access enabler for EBI       */
    bool privilegedEMU        : 1;     /**< Privileged access enabler for EMU       */
    bool privilegedETH        : 1;     /**< Privileged access enabler for ETH       */
    bool privilegedFPUEH      : 1;     /**< Privileged access enabler for FPUEH     */
    bool privilegedGPCRC      : 1;     /**< Privileged access enabler for GPCRC     */
    bool privilegedGPIO       : 1;     /**< Privileged access enabler for GPIO      */
    bool privilegedI2C0       : 1;     /**< Privileged access enabler for I2C0      */
    bool privilegedI2C1       : 1;     /**< Privileged access enabler for I2C1      */
    bool privilegedI2C2       : 1;     /**< Privileged access enabler for I2C2      */
    bool privilegedIDAC0      : 1;     /**< Privileged access enabler for IDAC0     */
    bool privilegedMSC        : 1;     /**< Privileged access enabler for MAC       */
    bool privilegedLCD        : 1;     /**< Privileged access enabler for LCD       */
    bool privilegedLDMA       : 1;     /**< Privileged access enabler for LDMA      */
    bool privilegedLESENSE    : 1;     /**< Privileged access enabler for LESENSE   */
    bool privilegedLETIMER0   : 1;     /**< Privileged access enabler for LETIMER0  */
    bool privilegedLETIMER1   : 1;     /**< Privileged access enabler for LETIMER1  */
    bool privilegedLEUART0    : 1;     /**< Privileged access enabler for LEUART0   */
    bool privilegedLEUART1    : 1;     /**< Privileged access enabler for LEUART1   */
    bool privilegedPCNT0      : 1;     /**< Privileged access enabler for PCNT0     */
    bool privilegedPCNT1      : 1;     /**< Privileged access enabler for PCNT1     */
    bool privilegedPCNT2      : 1;     /**< Privileged access enabler for PCNT2     */
    bool privilegedQSPI0      : 1;     /**< Privileged access enabler for QSPI0     */
    bool privilegedRMU        : 1;     /**< Privileged access enabler for RMU       */
    bool privilegedRTC        : 1;     /**< Privileged access enabler for RTC       */
    bool privilegedRTCC       : 1;     /**< Privileged access enabler for RTCC      */
    bool privilegedSDIO       : 1;     /**< Privileged access enabler for SDIO      */
    bool privilegedSMU        : 1;     /**< Privileged access enabler for SMU       */
    bool privilegedTIMER0     : 1;     /**< Privileged access enabler for TIMER0    */
    bool privilegedTIMER1     : 1;     /**< Privileged access enabler for TIMER1    */
    bool privilegedTIMER2     : 1;     /**< Privileged access enabler for TIMER2    */
    bool privilegedTIMER3     : 1;     /**< Privileged access enabler for TIMER3    */
    bool privilegedTIMER4     : 1;     /**< Privileged access enabler for TIMER4    */
    bool privilegedTIMER5     : 1;     /**< Privileged access enabler for TIMER5    */
    bool privilegedTIMER6     : 1;     /**< Privileged access enabler for TIMER6    */
    bool privilegedTRNG0      : 1;     /**< Privileged access enabler for TRNG0     */
    bool privilegedUART0      : 1;     /**< Privileged access enabler for UART0     */
    bool privilegedUART1      : 1;     /**< Privileged access enabler for UART1     */
    bool privilegedUSART0     : 1;     /**< Privileged access enabler for USART0    */
    bool privilegedUSART1     : 1;     /**< Privileged access enabler for USART1    */
    bool privilegedUSART2     : 1;     /**< Privileged access enabler for USART2    */
    bool privilegedUSART3     : 1;     /**< Privileged access enabler for USART3    */
    bool privilegedUSART4     : 1;     /**< Privileged access enabler for USART4    */
    bool privilegedUSART5     : 1;     /**< Privileged access enabler for USART5    */
    bool privilegedUSB        : 1;     /**< Privileged access enabler for USB       */
    bool privilegedWDOG0      : 1;     /**< Privileged access enabler for WDOG0     */
    bool privilegedWDOG1      : 1;     /**< Privileged access enabler for WDOG1     */
    bool privilegedWTIMER0    : 1;     /**< Privileged access enabler for WTIMER0   */
    bool privilegedWTIMER1    : 1;     /**< Privileged access enabler for WTIMER1   */
    bool privilegedWTIMER2    : 1;     /**< Privileged access enabler for WTIMER2   */
    bool privilegedWTIMER3    : 1;     /**< Privileged access enabler for WTIMER3   */

#elif defined(_SILICON_LABS_GECKO_INTERNAL_SDID_103)
    bool privilegedACMP0      : 1;     /**< Privileged access enabler for ACMP0     */
    bool privilegedACMP1      : 1;     /**< Privileged access enabler for ACMP1     */
    bool privilegedADC0       : 1;     /**< Privileged access enabler for ADC0      */
    bool privilegedCAN0       : 1;     /**< Privileged access enabler for CAN0      */
    bool privilegedCMU        : 1;     /**< Privileged access enabler for CMU       */
    bool privilegedCRYOTIMER  : 1;     /**< Privileged access enabler for CRYOTIMER */
    bool privilegedCRYPTO0    : 1;     /**< Privileged access enabler for CRYPTO0   */
    bool privilegedCSEN       : 1;     /**< Privileged access enabler for CSEN      */
    bool privilegedVDAC0      : 1;     /**< Privileged access enabler for VDAC0     */
    bool privilegedPRS        : 1;     /**< Privileged access enabler for PRS       */
    bool privilegedEMU        : 1;     /**< Privileged access enabler for EMU       */
    bool privilegedGPCRC      : 1;     /**< Privileged access enabler for GPCRC     */
    bool privilegedGPIO       : 1;     /**< Privileged access enabler for GPIO      */
    bool privilegedI2C0       : 1;     /**< Privileged access enabler for I2C0      */
    bool privilegedI2C1       : 1;     /**< Privileged access enabler for I2C1      */
    bool privilegedMSC        : 1;     /**< Privileged access enabler for MAC       */
    bool privilegedLCD        : 1;     /**< Privileged access enabler for LCD       */
    bool privilegedLDMA       : 1;     /**< Privileged access enabler for LDMA      */
    bool privilegedLESENSE    : 1;     /**< Privileged access enabler for LESENSE   */
    bool privilegedLETIMER0   : 1;     /**< Privileged access enabler for LETIMER0  */
    bool privilegedLEUART0    : 1;     /**< Privileged access enabler for LEUART0   */
    bool privilegedPCNT0      : 1;     /**< Privileged access enabler for PCNT0     */
    bool privilegedRMU        : 1;     /**< Privileged access enabler for RMU       */
    bool privilegedRTCC       : 1;     /**< Privileged access enabler for RTCC      */
    bool privilegedSMU        : 1;     /**< Privileged access enabler for SMU       */
    bool privilegedTIMER0     : 1;     /**< Privileged access enabler for TIMER0    */
    bool privilegedTIMER1     : 1;     /**< Privileged access enabler for TIMER1    */
    bool privilegedTRNG0      : 1;     /**< Privileged access enabler for TRNG0     */
    bool privilegedUART0      : 1;     /**< Privileged access enabler for UART0     */
    bool privilegedUSART0     : 1;     /**< Privileged access enabler for USART0    */
    bool privilegedUSART1     : 1;     /**< Privileged access enabler for USART1    */
    bool privilegedUSART2     : 1;     /**< Privileged access enabler for USART2    */
    bool privilegedUSART3     : 1;     /**< Privileged access enabler for USART3    */
    bool privilegedWDOG0      : 1;     /**< Privileged access enabler for WDOG0     */
    bool privilegedWTIMER0    : 1;     /**< Privileged access enabler for WTIMER0   */
    bool privilegedWTIMER1    : 1;     /**< Privileged access enabler for WTIMER1   */

#else
#error "No peripherals defined for SMU for this device configuration"
#endif
} SMU_PrivilegedAccess_TypeDef;

